public class Main {
    public static void main(String[] args) {
        //Задание 1
        int userAge = 17;
        if (userAge >=18) {
            System.out.println("Поздравляем! Вы уже совершеннолетний!");
        }
        if (userAge<18) {
            System.out.println("Вы ещё не достигли совершеннолетнего возраста, пожалуйста подождите немного!");
        }
    }
    //Задание 2

}